{
  "game_id": 377401904,
  "questions": "What does CPU stand for?\tCentral Processing Unit\nWhat does the controller do?\tThe controller sends and receives signals from all parts of the computer. It ensures that all processes take place at the right time and in the correct order.\nWhat does ALU stand for?\tArithmetic Logic Unit\nWhat does the Arithmetic Logic Unit do?\tThe ALU is the part of the CPU that processes and manipulates data. It performs simple calculations on the data that is temporarily stored in the registers.\nWhere would you find a register?\tA register is a storage location found on the CPU\nWhat does a register do?\tA register is where data or control information is temporarily stored. Registers are usually much faster to access than internal memory, since they have to be accessed so often\nWhat is the other name for level 1 memory?\tCACHE memory\nWhat information is held in level 1 memory?\tData is moved from the registers to the internal memory when it is not being actively used. Data from internal memory can then either be written to RAM or called back into the registers for further processing.\nList the 3 types of bus\tAddress bus, Data bus, Control bus\nWhat is the role of the address bus?\tWhen data is saved or loaded from memory, the address at which it is to be stored or loaded from must be sent. The storage address of data always travels along an address bus.\nWhat is the role of the data bus?\tData will then need to be moved between several parts of a computer. The path along which data travels is called a data bus.\nWhat is the role of the control bus?\tThe controller uses the control bus to send control signals to different parts of the computer.\nWhat innovation did Von Neumann bring to computer design?\tHe proposed storing the program instructions in the same place as the data. This allows for the Fetch-Execute-Cycle, fundamental to all modern computers\nWhat does F-D-E stand for?\tFetch - Decode - Execute\nWhat word is missing from this statement?: Fetch-...-Execute\tDecode\nWhere is the address of the next instruction for FDE stored?\tPC - Program Counter\nWhen an instruction is fetched from RAM where does it go?\tCIR - Current Instruction Register\nWhat must the control unit do to an instruction before executing it?\tThe instruction must be decoded\nWhy does a CPU only have a small amount of CACHE memory?\tBecause it is very expensive\nHow is clock speed measured?\tHz - number of instructions per second. Usually in KHz, MHz, or GHz\nWhat is overclocking?\tOverclocking is when a processor is set to run faster than its original design\nWhat is underclocking?\tUnderclocking is when a processor is set to run slower than its original design\nWhy would you underclock a CPU?\tReduces the amount of heat produced, reduces the amount of power needed, increases the battery life of the device\nWhat are the dangers of overclocking?\tIf extra heat is not removed through cooling, the CPU can overheat. This will damage the CPU and shorten its lifespan\nWhat are cores?\tA core is the term used to describe the processing components within the CPU. Multi-core processors therefore have many processing components within the same CPU\nHow many cores in a dual core CPU?\tTwo\nHow many cores in a quad core CPU?\tFour\nWhy would a dual core CPU not always be twice as fast as a single core CPU?\tYou may have to wait for other instructions to be completed first. The programmer may not have written their code to be execute in parallel\nWhat are the two types of instruction set?\tRISC and CISC\nWhat does RISC stand for?\tReduced Instruction Set Computer\nWhat does CISC stand for?\tComplex Instruction Set Computer\nWhat kinds of device use RISC chips?\tA portable device\nWhy would a device use a RISC chip?\tRISC chips use less power. This means better use from a battery\nWhat kinds of device use CISC chips?\tPowerful and desktop devices\nWhy would a device use a CISC chip?\tCan perform more complex tasks as plugged in can work at full power so no battery life to worry about\nWhat does RAM stand for?\tRandom Access Memory\nWhat does ROM stand for?\tRead Only Memory\nWhat does the term volatile mean?\tThe contents of memory are lost when the power is turned off\nWhich memory type is volatile - RAM or ROM?\tRAM\nWhat information is stored in RAM?\tRAM stores all the information and data on programs currently running on the computer\nWhat information is stored in ROM?\tROM stores information such as the bios and programs that do not need to change\nWhat is secondary storage?\tSecondary storage is non-volatile storage. It is used to hold data that is frequently accessed\nWhat is magnetic storage?\tThere are two 'heads' that spin and access data on the disk. A write-head changes data and a read-head accesses the data.\nWhy would a company choose to use magnetic storage?\tIt can store a large amount of data, it is very cheap, it is good for data backups and archives\nGive 2 examples of magnetic storage\tHard drive, Magnetic Tape\nWhat is optical storage?\tOptical storage uses laser technology to project beams of light onto a disk. If light is reflected back then the data is recorded as 1, no reflection records a 0\nWhy would a company choose to use optical storage?\tGood for storing multimedia files such as audio and video\nGive 2 examples of optical storage\tCD, DVD, Bluray\nWhat is solid state storage?\tThis technology is named as such because there are no moving parts\nWhy would a company choose to use solid state storage?\tUses very little power, no moving parts to go wrong, very fast access speeds\nHow is a solid state hard drive different from a magnetic hard drive?\tGenerally smaller in capacity. Much faster and quieter\nGive 2 examples of solid state storage\tSSD hard drives, camera memory cards, USB memory sticks\nWhat is cloud storage?\tWhen data is stored in the 'cloud' it is actually held on servers that can be accessed from any computer with an internet connection\nWhy would a company choose to use cloud storage?\tAllows access anywhere in the world. Stored in multiple places so very little risk of data being lost\nWhat are the possible disadvantages of using cloud storage?\tMust have the internet to be able to access. Not always sure where servers are or which country data is passing into/through\nWhat does a motherboard do?\tConnects all of the different components together\nWhat does GPU stand for?\tGraphics Processing Unit\nWhat does a graphics card do?\tA GPU is a processor that produces graphical images to be displayed on a monitor.\nWhat does a sound card do?\tSound cards convert digital data into analog sound waves to output audio through speakers or headphones.\nWhy can't a computer record an analog sound?\tComputer must have things in 0 or 1. This means that it has to break something (like a curve) into lots of exact sections\nWhat is an embedded system?\tAn embedded system is a small computer inside of a larger device that performs a specific task.\nWhat kind of software would you find in an embedded system?\tSoftware in embedded systems are dedicated (performing a single-task). Will have limited computer hardware resources, little memory and minimal storage\nGive 2 examples of an embedded system\tSat Nav, Washing Machine, Smart TV"
}